<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Lab: Cleaning Rock Song Data

_Authors: Dave Yerrington (SF)_

---

### 1. Load `rock.csv` and do an initial examination of its data columns.

In [22]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import os

%matplotlib inline
#pwd
# ?users = pd.read_csv('/⁨Users⁩/hanhuang⁩/General Assembly⁩/⁨Class 111619 Files', sep='|')
# ?os.chdir('⁩/⁨Users⁩/hanhuang⁩/General Assembly⁩/⁨Class 111619 Files')

In [34]:
pwd

'/Users/hanhuang/General Assembly/Class Work - My Work '

In [35]:
rockfile = pd.read_csv('./rock.csv', sep=',')

In [37]:
rockfile.head(2)

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0

In [38]:
print(rockfile.shape)
print(rockfile.dtypes)

(2230, 8)
Song Clean      object
ARTIST CLEAN    object
Release Year    object
COMBINED        object
First?           int64
Year?            int64
PlayCount        int64
F*G              int64
dtype: object

### 2.  Clean up the column names.

Let's clean up the column names. There are two ways we can accomplish this:

#### 2.A Change the column names when you import the data using `pd.read_csv()`.

Notice that, when passing `names=[..A LIST OF STRING..]` with a number of columns that matches the number of strings in the passed list, you replace the column names.

NOTE: When you create custom column names, the first row of the `.csv` already represents a header. It is important to tell `pandas` to skip that row. The `skiprows=1` keyword argument to `read_csv()` will tell `pandas` to skip the first row.

In [39]:
rockfile_columns = ['Song','Artist','Release', 'Combined', 'First','Year', 'PlayCount','First*Playcount']

#### 2.B Change column names using the `.rename()` function.

The `.rename()` function takes an argument, `columns=name_dict`, in which `name_dict` is a dictionary containing the original column names as keys and the new column names as values.

In [40]:
rockfile = pd.read_csv('./rock.csv', header=0, names=rockfile_columns)
rockfile.head()

,Song,Artist,Release,Combined,First,Year,PlayCount,First*Playcount
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

#### 2.C Reassigning the `.columns` attribute of a DataFrame.

You can also just reassign the `.columns` attribute to a list of strings containing the new column names. 

The only caveat with reassigning `.columns` is that you have to reassign all of the column names at once. You can't partially replace a value by working on `.columns` directly. You have to reassign `.columns` with a list of equal length.

### 3. Subsetting data where null values exist.

We have mixed `str` and `NaN` values in the `release` column. `NaN` stands for "not a number" and is the way `pandas` handles "nulls" or nonexistent data. We can use the `.isnull()` method of a Series to find null values.

Print the header of the data subset to where the `release` column is null values.

In [41]:
rockfile[(rockfile['Release'].isnull())]

,Song,Artist,Release,Combined,First,Year,PlayCount,First*Playcount
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
10,"Baby, Please Don't Go",AC/DC,NaN,"Baby, Please Don't Go by AC/DC",1,0,1,0
13,CAN'T STOP ROCK'N'ROLL,AC/DC,NaN,CAN'T STOP ROCK'N'ROLL by AC/DC,1,0,5,0
16,Girls Got Rhythm,AC/DC,NaN,Girls Got Rhythm by AC/DC,1,0,24,0
24,Let's Get It Up,AC/DC,NaN,Let's Get It Up by AC/DC,1,0,4,0
...,...,...,...,...,...,...,...,...
2216,"I'm Bad, I'm Nationwide",ZZ Top,NaN,"I'm Bad, I'm Nationwide by ZZ Top",1,0,10,0
2218,Just Got Paid,ZZ Top,NaN,Just Got Paid by ZZ Top,1,0,2,0
2221,My Head's In Mississippi,ZZ Top,NaN,My Head's In Mississippi by ZZ Top,1,0,1,0
2222,Party On The Patio,ZZ Top,NaN,Party On The Patio by ZZ Top,1,0,14,0
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0

### 4. Update slices of your DataFrame based on mask selection/slices.

In many scenarios, we want to upate values in our DataFrame according to criteria. Let's say we wanted to set all of the null values in `release` to 0.

With newer versions of `pandas`, in order to manipulate data in the original DataFrame, we have to use `.loc` while performing reassignment using a mask and an index.

For example, the following won't always work:
```python
df[row_mask]['column_name'] = new_value
```

The best way to accomplish the same task is:
```python
df.loc[row_mask, 'column_name'] = new_value
```

For multiple column assignment, you would use:
```python
df.loc[row_mask, ['col_1', 'col_2', 'col_3']] = new_value
```

#### 4.A Let's try it out. Make all of the null values in `release` 0.

In [42]:
rockfile['Release'].fillna(0,inplace=True)

#### 4.B Verify that `release` contains no null values.

In [43]:
rockfile['Release'].count()

2230

### 5. Ensure that the data types of the columns make sense. 

Verifying column data types is a critical part of data munging. If columns have the wrong data type, then there is usually corrupted or incorrect data in some of the observations.

#### 5.A Look at the data types for the columns. Are any incorrect given what the data represents?

In [44]:
rockfile['Release'].value_counts()
# SONGFACTS.COM result

0                577
1973             104
1975              83
1977              83
1970              81
1971              75
1969              72
1980              70
1978              64
1979              63
1967              61
1981              61
1983              60
1976              56
1982              54
1984              51
1972              50
1974              48
1968              46
1987              39
1985              39
1986              37
1991              34
1989              32
1966              30
1988              29
1965              28
1994              25
1990              22
1993              19
1964              14
1992              14
1999              13
1995              10
1997               9
1963               9
1996               9
1998               6
2002               6
2004               5
2005               5
2012               5
2001               4
2007               3
2008               3
2000               3
1962               3
2003               3
2011               3
2013               2
2014               2
1961               1
1071               1
1958               1
2006               1
1955               1
SONGFACTS.COM      1
Name: Release, dtype: int64

### 6. Investigate and clean up the `release` column.

The `release` column is a string data type when it should be an integer.

#### 6.A Figure out what value(s) are causing the `release` column to be encoded as a string instead of an integer.

In [49]:
rockfile.loc[rockfile['Release'] == 'SONGFACTS.COM']

,Song,Artist,Release,Combined,First,Year,PlayCount,First*Playcount
1504,Bullfrog Blues,Rory Gallagher,SONGFACTS.COM,Bullfrog Blues by Rory Gallagher,1,1,1,1

#### 6.B Look at the rows in which there is incorrect data in the `release` column.

In [48]:
rockfile.loc[rockfile['Release'] == 'SONGFACTS.COM']

,Song,Artist,Release,Combined,First,Year,PlayCount,First*Playcount
1504,Bullfrog Blues,Rory Gallagher,SONGFACTS.COM,Bullfrog Blues by Rory Gallagher,1,1,1,1

#### 6.C. Clean up the data. Normally we may replace the offending data with null np.nan values, however we previously converted all of the nan values in the release column to zeros so we might as well continue with the same practice. Replacing with 0 (or nan) will allow us to convert the column to numeric.

In [50]:
# Replace all instances of a value in a column (must match entire value).
rockfile['Release']replace('SONGFACTS.COM', 0, inplace=True)

SyntaxError: invalid syntax (<ipython-input-50-80766c6beb18>, line 2)

### 7. Get summary statistics for the `release` column using the `.describe()` function.

Now that the `release` column is finally a numeric data type, we can apply the `.describe()` function.  

#### 7.A Print out the summary stats for the `release` column. What is the earliest and latest release date?

In [55]:
rockfile.describe()

        First         Year    PlayCount  First*Playcount
count  2230.0  2230.000000  2230.000000      2230.000000
mean      1.0     0.741256    16.872646        15.048430
std       0.0     0.438043    25.302972        25.288366
min       1.0     0.000000     0.000000         0.000000
25%       1.0     0.000000     1.000000         0.000000
50%       1.0     1.000000     4.000000         3.000000
75%       1.0     1.000000    21.000000        18.000000
max       1.0     1.000000   142.000000       142.000000

In [54]:
print('Min value for release = 1071')
print('Min value for release = 2006')

Min value for release = 1071
Min value for release = 2006

#### 7.B Based on the summary statistics, is there anything else wrong with the `release` column?

In [56]:
print('"1071" needs to be changed to a 0')

"1071" needs to be changed to a 0

_Looking at the DataFrame that contains the year 1071, we can see that the year was probably corrupted and should be replaced with something else if possible._

### 8. Make changes and investigate using custom functions with `.apply()`.

Let's say we want to traverse every single row in our data set and apply a function to that row.

#### 8.A Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970.

In [60]:
# wasn't able to change int in 'release' so have created another column and done the filter as an example 
less_than_1970 = rockfile ['PlayCount'] < 1970
rockfile['less_than_1970']=less_than_1970
rockfile[rockfile['less_than_1970'] < 15].loc[4, ['Song', 'Artist']]

Song      Art For Arts Sake
Artist                 10cc
Name: 4, dtype: object

#### 8.B Using the `.apply()` function, apply the function you wrote to the first four rows of the DataFrame.

You will need to tell the `apply` function to operate row by row. Setting the keyword argument as `axis=1` indicates that the function should be applied to each row individually.

In [61]:
rockfile[rockfile['less_than_1970'] < 15].loc[0:3,['Song', 'Artist']]

                     Song       Artist
0        Caught Up in You  .38 Special
1            Fantasy Girl  .38 Special
2         Hold On Loosely  .38 Special
3  Rockin' Into the Night  .38 Special

You'll notice that there will be a final output Series of `None` values. The `.apply()` function, if a return value is not specified, will return a Series of `None` values (similar to how the default return for Python functions is `None` when a return statement is not specified).

### 9. Write a function that converts cells in a DataFrame to float and otherwise replaces them with `np.nan`.

If applied to our data, it would keep only the numeric information and otherwise input null values.

Recall that the try-except syntax in Python is a great way to try something and take another action if the initial step fails:

```python
try:
    Perform some action.
except:
   Perform some other action if the first failed with an error.
```

#### 9.A Write the function that takes a column and converts all of its values to float if possible and `np.nan` otherwise. The return value should be the converted Series.

In [19]:
# A:

#### 9.B Try your function out on the rock song data and ensure the output is what you expected.

In [20]:
# A:

#### 9.C Describe the new float-only DataFrame.

In [21]:
# A: